{
  "version": "1.0",
  "created_at": "2026-02-23T16:10:00Z",
  "updated_at": "2026-02-23T16:13:25.822711+00:00",
  "current_agent": "orchestrator",
  "agent_status": {
    "orchestrator": {
      "status": "completed",
      "started_at": "2026-02-23T16:10:00Z",
      "completed_at": "2026-02-23T16:13:25.822683+00:00",
      "error": null
    },
    "researcher": {
      "status": "pending",
      "started_at": null,
      "completed_at": null,
      "error": null
    },
    "writer": {
      "status": "pending",
      "started_at": null,
      "completed_at": null,
      "error": null
    },
    "reviewer": {
      "status": "pending",
      "started_at": null,
      "completed_at": null,
      "error": null
    }
  },
  "phases": [
    {
      "id": "phase_1",
      "name": "Problem Analysis & Literature Review",
      "order": 1,
      "items": [
        {
          "id": "item_001",
          "description": "Analyze repository structure and define project scope for asymmetric TSP on real road networks",
          "acceptance_criteria": "A written document (docs/project_scope.md) listing: (1) all repo directories and their intended purposes, (2) the precise problem variant being targeted (asymmetric TSP with time-dependent costs on OSRM-derived graphs), (3) target instance sizes (50–10,000 nodes), and (4) the success criterion of >=0.5% improvement over LKH-3 on OSRM distance matrices.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_002",
          "description": "Conduct literature review on classical TSP and ATSP heuristics (LKH, Concorde, Christofides, Or-Tools)",
          "acceptance_criteria": "Web search performed for at least 5 distinct queries covering: LKH-3 algorithm and its ATSP transformation, Concorde's cutting-plane approach, Christofides algorithm and ATSP extensions, Or-Tools routing solver internals, and VROOM's VRP heuristics. Summary document (docs/lit_review_classical.md) produced with at least 2 paragraphs per solver describing algorithmic approach, known strengths/weaknesses on asymmetric instances, and computational complexity characteristics.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_003",
          "description": "Conduct literature review on ML-based and hybrid neural combinatorial optimization for TSP",
          "acceptance_criteria": "Web search performed covering: Attention Model (Kool et al. 2019), POMO (Kwon et al. 2020), GLOP (Ye et al. 2024), LEHD heavy decoder approach, Embed-LKH (ICLR 2025), UNiCS unified neural-guided solver, and reinforced LKH algorithms. Summary document (docs/lit_review_ml.md) produced covering at least 8 distinct approaches with their reported performance gaps vs LKH-3 on standard benchmarks.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_004",
          "description": "Survey available benchmark datasets and real-world road network data sources for ATSP evaluation",
          "acceptance_criteria": "Web search performed for: TSPLIB asymmetric instances, DIMACS TSP Challenge instances, Korea TSP (Waterloo/Roskilde 2024-2025), Applied Sciences ACVRP benchmarks (2021), TSPTW instance sets (Lopez-Ibanez), and OSMnx-based graph extraction methods. Summary document (docs/benchmarks_survey.md) produced listing at least 5 data sources with instance counts, size ranges, and accessibility notes.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_005",
          "description": "Create and maintain sources.bib with BibTeX entries for all consulted sources",
          "acceptance_criteria": "File sources.bib exists in repo root containing valid BibTeX entries for at least 15 relevant papers including: Helsgaun LKH-3 report, Applegate et al. Concorde, Kool et al. Attention Model, Kwon et al. POMO, Ye et al. GLOP, Vinyals et al. Pointer Networks, Joshi et al. GNN for TSP, the Applied Sciences ACVRP benchmark paper, the Korea TSP project documentation, and at least 6 additional papers discovered during the literature review. Each entry must have author, title, year, and venue fields.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_006",
          "description": "Write formal problem specification defining the ATSP variant, cost model, and constraint taxonomy",
          "acceptance_criteria": "Document (docs/problem_spec.md) containing: (1) mathematical formulation of the asymmetric TSP with time-dependent edge costs, (2) formal definition of the OSRM-derived cost model including how traffic profiles create time-dependence, (3) taxonomy of constraints (time windows, vehicle capacity, turn penalties) with notation for which are in-scope for this project, and (4) formal statement of the optimization objective. Must reference at least 3 papers from sources.bib.",
          "status": "pending",
          "notes": null,
          "error": null
        }
      ]
    },
    {
      "id": "phase_2",
      "name": "Baseline Implementation & Metrics",
      "order": 2,
      "items": [
        {
          "id": "item_007",
          "description": "Set up OSRM backend and build pipeline to extract asymmetric distance/time matrices from OpenStreetMap data",
          "acceptance_criteria": "A working Python script (src/data/osrm_pipeline.py) that: (1) downloads OSM extracts for at least 3 geographic regions (e.g., Berlin, Manhattan, Tokyo) using Geofabrik or BBBike, (2) launches OSRM backend with car profile, (3) generates asymmetric n×n travel-time matrices via OSRM Table API for randomly sampled node sets, (4) serializes matrices to a documented format (e.g., TSPLIB ATSP format or NumPy .npy). Pipeline must run end-to-end and produce at least one valid matrix verified by checking asymmetry (A[i,j] != A[j,i] for some i,j).",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_008",
          "description": "Generate benchmark instance sets from multiple geographic regions at varying scales",
          "acceptance_criteria": "A benchmark generation script (src/data/generate_benchmarks.py) that produces instance sets across: (1) 3+ geographic regions, (2) 5 scale tiers (50, 200, 500, 1000, 5000 nodes), (3) at least 10 random instances per (region, scale) pair. All instances stored in results/benchmarks/ with metadata JSON recording region, node count, sampling seed, and matrix statistics (mean, std, asymmetry ratio). Total of at least 150 instances generated.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_009",
          "description": "Implement LKH-3 baseline solver wrapper with parameter configuration",
          "acceptance_criteria": "A Python wrapper (src/solvers/lkh3_solver.py) that: (1) accepts an ATSP distance matrix or TSPLIB file, (2) generates LKH-3 parameter files with configurable settings (RUNS, MAX_TRIALS, SEED, MOVE_TYPE), (3) invokes LKH-3 binary and parses the output tour, (4) returns tour cost and tour sequence. Wrapper must be validated on at least 3 known TSPLIB ATSP instances (e.g., ftv33, ftv44, rbg323) with solutions within 1% of published best-known values.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_010",
          "description": "Implement additional baseline solvers: Or-Tools, nearest-neighbor, and greedy construction heuristics",
          "acceptance_criteria": "Python modules in src/solvers/ implementing: (1) Or-Tools routing solver wrapper (ortools_solver.py) using the routing library with configurable search strategies, (2) nearest-neighbor heuristic (nn_solver.py) with random start selection, (3) greedy/farthest-insertion heuristic (greedy_solver.py). Each solver must conform to a common interface (solve(matrix) -> Tour) defined in src/solvers/base.py. All solvers validated on the same TSPLIB instances used for LKH-3.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_011",
          "description": "Define evaluation metrics and build automated benchmarking harness",
          "acceptance_criteria": "A benchmarking framework (src/benchmark/runner.py) that: (1) runs any registered solver against any instance set, (2) records per-instance metrics: tour cost, wall-clock time, gap vs best-known solution, (3) computes aggregate statistics: mean gap, median gap, worst-case gap, mean solve time, (4) outputs results to CSV and JSON in results/. Framework includes a CLI entry point (e.g., python -m src.benchmark.runner --solver lkh3 --instances results/benchmarks/). Must include a test run on at least 10 instances producing a valid results CSV.",
          "status": "pending",
          "notes": null,
          "error": null
        }
      ]
    },
    {
      "id": "phase_3",
      "name": "Core Research & Novel Approaches",
      "order": 3,
      "items": [
        {
          "id": "item_012",
          "description": "Design hybrid heuristic architecture combining ML edge scoring with LK-style local search",
          "acceptance_criteria": "Architecture document (docs/architecture.md) with: (1) system diagram showing data flow from OSRM matrix through feature extraction, ML scoring model, and local search components, (2) specification of the ML model's role (edge probability scoring to guide candidate edge selection in LK moves), (3) description of how the ML model output integrates with LKH's alpha-nearness or candidate set generation, (4) comparison table showing how this differs from Embed-LKH and UNiCS approaches cited in sources.bib. Must identify at least 2 novel design choices motivated by road network properties (e.g., exploiting spatial hierarchy, asymmetry structure).",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_013",
          "description": "Implement GNN-based edge scoring model trained on road network topology and OSRM features",
          "acceptance_criteria": "A PyTorch/PyG module (src/models/edge_scorer.py) implementing a Graph Neural Network that: (1) takes as input node features (lat/lon, degree, betweenness centrality) and edge features (OSRM travel time, distance, asymmetry ratio A[i,j]/A[j,i]), (2) outputs per-edge scores predicting probability of edge inclusion in optimal/near-optimal tour, (3) is trained on solved instances from Phase 2 benchmarks using binary cross-entropy loss. Model must achieve >0.7 AUC on a held-out validation set of at least 20 instances. Training script (src/models/train.py) must log loss curves to results/training/.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_014",
          "description": "Implement learned perturbation operators that exploit asymmetry and road network structure",
          "acceptance_criteria": "Module (src/solvers/learned_perturbation.py) implementing at least 3 perturbation operators: (1) asymmetry-aware or-opt moves that preferentially reverse segments where A[i,j] << A[j,i], (2) cluster-based perturbation using geographic proximity and road connectivity, (3) ML-guided double-bridge moves where the bridge points are selected using the edge scorer from item_013. Each operator must be individually testable and show measurable improvement (any positive gap reduction) over random perturbation on at least 5 test instances.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_015",
          "description": "Develop asymmetry-aware candidate set generation to replace LKH's alpha-nearness for road networks",
          "acceptance_criteria": "Module (src/solvers/candidate_sets.py) implementing: (1) asymmetric alpha-nearness computation that accounts for directional cost differences, (2) road-network-aware candidate filtering using OSRM route structure (preferring edges along actual road segments over Euclidean-close but road-distant nodes), (3) configurable candidate set size (5–15 neighbors). Must demonstrate that on at least 10 OSRM-derived instances, the candidate sets contain a higher fraction of optimal tour edges (measured by hit rate) compared to standard LKH alpha-nearness candidates, with statistical significance (p < 0.05, paired t-test).",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_016",
          "description": "Implement time-dependent cost model extensions for traffic-aware routing",
          "acceptance_criteria": "Module (src/data/traffic_model.py) that: (1) accepts OSRM speed profiles or synthetic traffic multiplier functions (e.g., rush hour 1.5x-3x penalties) to create time-dependent cost matrices, (2) implements a departure-time-dependent matrix evaluation function, (3) integrates with the solver interface so that tour cost is evaluated respecting time-dependent traversal. Validated by showing that tour cost changes by >5% between peak and off-peak departure times on at least 3 instances.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_017",
          "description": "Integrate all ML components into a unified hybrid iterative local search solver",
          "acceptance_criteria": "A complete hybrid solver (src/solvers/hybrid_solver.py) that: (1) uses GNN edge scorer (item_013) to generate initial candidate sets (item_015), (2) constructs an initial tour using ML-guided nearest-neighbor, (3) improves the tour using LK-style moves with learned perturbation operators (item_014), (4) iterates with perturbation-and-improve cycles. Solver must conform to the common interface from item_010 and run successfully on instances from 50 to 1000 nodes. Must produce a valid tour (visiting all nodes exactly once) on all test instances.",
          "status": "pending",
          "notes": null,
          "error": null
        }
      ]
    },
    {
      "id": "phase_4",
      "name": "Experiments & Evaluation",
      "order": 4,
      "items": [
        {
          "id": "item_018",
          "description": "Run comprehensive baseline experiments across all benchmark instances and record results",
          "acceptance_criteria": "Complete baseline results in results/baselines/ containing: (1) LKH-3 results on all 150+ benchmark instances with 5 independent runs per instance (varying SEED), (2) Or-Tools results on all instances, (3) nearest-neighbor and greedy heuristic results on all instances. Results CSV must include columns: instance_id, solver, run_id, tour_cost, wall_clock_seconds, node_count, region. Summary statistics table showing mean/median/worst gap relative to best-found solution across all solvers.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_019",
          "description": "Run hybrid solver experiments with systematic hyperparameter search",
          "acceptance_criteria": "Complete hybrid solver results in results/hybrid/ from: (1) grid search or random search over at least 20 hyperparameter configurations (GNN hidden dim, candidate set size, perturbation operator weights, number of LK iterations, restart count), (2) 5 independent runs per configuration on a representative subset of at least 30 instances. Results must include all metrics from the benchmarking harness (item_011). A hyperparameter analysis document (docs/hyperparam_analysis.md) identifying the best configuration and sensitivity of each parameter.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_020",
          "description": "Conduct ablation studies isolating the contribution of each novel component",
          "acceptance_criteria": "Ablation results in results/ablation/ from running on at least 50 instances the following variants: (1) hybrid solver with random edge scores instead of GNN (ablates ML scoring), (2) hybrid solver with standard alpha-nearness instead of road-aware candidates (ablates candidate sets), (3) hybrid solver with random perturbation instead of learned operators (ablates learned perturbation), (4) hybrid solver with all components (full model). Results table showing mean gap for each variant with 95% confidence intervals. Each component must have a clearly measurable contribution quantified as gap reduction in percentage points.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_021",
          "description": "Perform scaling experiments comparing wall-clock time and solution quality from 50 to 5000 nodes",
          "acceptance_criteria": "Scaling results in results/scaling/ from running LKH-3 and the hybrid solver on instances at scales 50, 100, 200, 500, 1000, 2000, 5000 nodes (at least 5 instances per scale). Results must include: (1) plot data for solution quality gap vs. node count, (2) plot data for wall-clock time vs. node count, (3) analysis of at which scale the hybrid approach becomes competitive or loses advantage relative to LKH-3. Time measurements must exclude OSRM matrix generation.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_022",
          "description": "Perform statistical significance testing of hybrid solver vs LKH-3 results",
          "acceptance_criteria": "Statistical analysis in results/significance/ containing: (1) Wilcoxon signed-rank test results comparing hybrid vs LKH-3 tour costs across all instances with p-values reported, (2) bootstrap 95% confidence intervals for the mean gap difference, (3) per-region and per-scale breakdown of significance results, (4) effect size (Cohen's d or rank-biserial correlation). The primary hypothesis test (hybrid beats LKH-3 overall) must be clearly stated with its p-value. Results must reference comparable statistical methodology from prior work in sources.bib.",
          "status": "pending",
          "notes": null,
          "error": null
        }
      ]
    },
    {
      "id": "phase_5",
      "name": "Analysis & Documentation",
      "order": 5,
      "items": [
        {
          "id": "item_023",
          "description": "Generate publication-quality figures: convergence plots, gap distributions, geographic tour visualizations",
          "acceptance_criteria": "At least 6 figures saved to figures/ including: (1) box plot of gap distributions by solver and scale, (2) convergence curves showing tour cost vs. iteration for hybrid vs LKH-3 on representative instances, (3) geographic visualization of tours overlaid on OSM maps for at least 2 regions, (4) ablation bar chart with confidence intervals, (5) scaling plot (quality vs. node count), (6) scaling plot (time vs. node count). All figures must be publication-quality (labeled axes, legends, >=300 DPI PNG or vector PDF).",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_024",
          "description": "Analyze failure modes and characterize instance properties where the hybrid approach excels or struggles",
          "acceptance_criteria": "Analysis document (docs/failure_analysis.md) containing: (1) identification of instance characteristics (asymmetry ratio, clustering coefficient, geographic spread) correlated with hybrid solver advantage using correlation analysis, (2) at least 3 specific failure case studies where hybrid underperforms LKH-3, with hypothesized explanations, (3) at least 3 success case studies where hybrid significantly outperforms LKH-3, with analysis of why. Must reference relevant prior work from sources.bib when discussing failure modes.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_025",
          "description": "Compile final research report with methodology, results, and comparison to prior work",
          "acceptance_criteria": "A comprehensive report (docs/report.md or docs/report.pdf) with sections: (1) Introduction and motivation, (2) Related work citing at least 10 papers from sources.bib, (3) Problem formulation, (4) Methodology describing the hybrid approach, (5) Experimental setup, (6) Results with tables and figure references, (7) Discussion comparing against results reported in prior work (Embed-LKH, UNiCS, GLOP gap values on comparable instances), (8) Limitations and future work, (9) Conclusion. Report must be at least 3000 words.",
          "status": "pending",
          "notes": null,
          "error": null
        },
        {
          "id": "item_026",
          "description": "Create reproducibility package with environment specifications, scripts, and step-by-step instructions",
          "acceptance_criteria": "Reproducibility artifacts including: (1) requirements.txt or pyproject.toml with pinned dependency versions, (2) Dockerfile or docker-compose.yml for OSRM backend setup, (3) a Makefile or shell script (scripts/reproduce.sh) that runs the full pipeline from data generation through final results, (4) updated README.md with installation instructions, usage examples, and expected output. A fresh clone must be able to reproduce baseline results within 2% of reported values by following the documented steps.",
          "status": "pending",
          "notes": null,
          "error": null
        }
      ]
    }
  ],
  "summary": {
    "total_items": 26,
    "completed": 0,
    "in_progress": 0,
    "failed": 0,
    "pending": 26
  }
}